########## Тема 3. Модулі datetime та time. Робота з випадковими величинами


'''
Модулі datetime та time. Робота з випадковими величинами. Модуль math.
Python містить інструменти, призначені для роботи з датою і часом, які дозволяють представляти їх у форматі, зрозумілому для користувачів. Ви звикли до стандартного відображення дати в календарях пошти, на веб-сайтах тощо.



Однак у програмуванні дати виглядають інакше, і для здійснення перетворень між різними форматами в Python використовується спеціальний вбудований модуль datetime. Цей модуль надає класи для маніпуляцій з датами і часом.



Основні можливості datetime:

визначення поточної дати і часу;
обчислення інтервалу між двома подіями;
визначення дня тижня, високосного року для будь-якої дати у минулому не раніше року datetime.MINYEAR або в майбутньому не пізніше року datetime.MAXYEAR;
порівняння дати і часу декількох подій за допомогою операторів порівняння;
робота з часовими зонами, порівняння подій з урахуванням часових зон та переходу на літній/зимовий час;
перетворення дати/часу в рядок і навпаки.


Перед роботою з датами і часом потрібно імпортувати модуль в нашому скрипті:



import datetime



Для отримання поточної дати і часу використовується метод datetime.now():



✂️ Цей код можна запустити!

import datetime
now = datetime.datetime.now()
print(now)



Виведення у форматі рік-місяць-день години:хвилини:секунди.мікросекунди:



2023-12-14 12:39:29.992996



Роботу з модулями ми ще розглянемо, але об'єкт datetime в свій скрипт ми також можемо отримати, просто витягнув його з модуля:



from datetime import datetime



Так — і модуль і об'єкт мають однакове ім'я, ви все вірно зрозуміли. 😉

У результаті виклику методу now() ми отримуємо об'єкт datetime, у якого є ряд корисних атрибутів:



from datetime import datetime

current_datetime = datetime.now()

print(current_datetime.year)
print(current_datetime.month)
print(current_datetime.day)
print(current_datetime.hour)
print(current_datetime.minute)
print(current_datetime.second)
print(current_datetime.microsecond)
print(current_datetime.tzinfo)



Ось основні з них:



year: Повертає рік дати. Наприклад, якщо now містить дату "2023-12-14 12:39:29", now.year буде 2023.
month: Повертає місяць як число від 1 до 12. У нашому прикладі now.month буде 12.
day: Повертає день місяця. Для "2023-12-14 12:39:29" now.day буде 14.
hour: Повертає годину дня від 0 до 23. У нашому випадку now.hour буде 12.
minute: Повертає хвилини часу від 0 до 59. Для даної дати now.minute буде 39.
second: Повертає секунди часу від 0 до 59. В нашому прикладі now.second буде 29.
microsecond: Повертає мікросекунди часу. Це значення може бути від 0 до 999999. У "2023-12-14 12:39:29.992996", now.microsecond буде 992996.
tzinfo: Повертає інформацію про часову зону об'єкта datetime. Для now, якщо часова зона не була вказана, tzinfo буде None.


В об'єкта datetime є методи, щоб отримати дату (без часу) та час (без дати):



✂️ Цей код можна запустити!

from datetime import datetime

current_datetime = datetime.now()
print(current_datetime.date())
print(current_datetime.time())



Виведення:

2023-12-14
12:59:06.709007



Є зворотний метод datetime.combine який використовується для створення нового об'єкта datetime шляхом комбінування об'єктів date та time. Це дозволяє створювати точний момент часу, вказуючи дату та час окремо, а потім об'єднуючи їх.



Основний синтаксис:

datetime.datetime.combine(date_object, time_object)



date_object: Об'єкт date, який містить інформацію про рік, місяць та день.
time_object: Об'єкт time, який містить інформацію про години, хвилини, секунди та мікросекунди.


Розглянемо приклад:



✂️ Цей код можна запустити!

import datetime

# Створення об'єктів date і time
date_part = datetime.date(2023, 12, 14)
time_part = datetime.time(12, 30, 15)

# Комбінування дати і часу в один об'єкт datetime
combined_datetime = datetime.datetime.combine(date_part, time_part)

print(combined_datetime)  # Виведе "2023-12-14 12:30:15"



У цьому прикладі ми створюємо об'єкт date для представлення конкретної дати (14 грудня 2023 року) і об'єкт time для представлення конкретного часу (12:30:15). Потім ми використовуємо datetime.combine для створення нового об'єкта datetime, який представляє цей конкретний момент часу.



Цей метод є корисним, коли у вас є окремі компоненти дати та часу, які потрібно об'єднати для отримання точного моменту в часі.



Щоб створити об'єкт datetime з конкретною вибраною датою у Python, можна використовувати конструктор класу datetime.datetime, передаючи йому рік, місяць, і день як аргументи. Також можна вказати годину, хвилину, секунду та мікросекунду, але це не обов'язково — якщо їх пропустити, вони будуть встановлені на 0.



Для створення об'єкта datetime з певною датою:



✂️ Цей код можна запустити!

import datetime

# Створення об'єкта datetime з конкретною датою
specific_date = datetime.datetime(year=2020, month=1, day=7)

print(specific_date)  # Виведе "2020-01-07 00:00:00"



У цьому прикладі створюється об'єкт datetime для 7 січня 2020 року. Оскільки час не вказано, він автоматично встановлюється на початок дня (00:00:00).



Виведення:



2020-01-07 00:00:00



Створення об'єкта datetime з датою та часом



✂️ Цей код можна запустити!

import datetime

# Створення об'єкта datetime з конкретною датою і часом
specific_datetime = datetime.datetime(year=2020, month=1, day=7, hour=14, minute=30, second=15)

print(specific_datetime)  # Виведе "2020-01-07 14:30:15"



Виведення:

2020-01-07 14:30:15



Тут створюється об'єкт datetime для 7 січня 2020 року о 14:30:15.

Використання ключових параметрів допомагає уникнути плутанини та забезпечує чіткість при вказівці конкретних компонентів часу. Наприклад попередній приклад можна було записати так:



✂️ Цей код можна запустити!

import datetime

# Створення об'єкта datetime з конкретною датою і часом
specific_datetime = datetime.datetime(2020, 1, 7, 14, 30, 15)

print(specific_datetime)  # Виведе "2020-01-07 14:30:15"



Але використання ключових параметрів робить код більш зрозумілим, особливо коли його читають інші розробники. Також це дозволяє легко вказувати тільки ті компоненти дати/часу, які вам потрібні, та уникнути помилок зі змішуванням порядку параметрів.



Метод weekday() використовується для отримання номера дня тижня для вказаної дати. Він повертає номер дня тижня, де понеділок має номер 0, а неділя - 6.



✂️ Цей код можна запустити!

from datetime import datetime

# Створення об'єкта datetime
now = datetime.now()

# Отримання номера дня тижня
day_of_week = now.weekday()

# Поверне число від 0 (понеділок) до 6 (неділя)
print(f"Сьогодні: {day_of_week}")  



У прикладі вище 14 грудня 2023 року було четвер. Виведення:

Сьогодні: 3



Метод часто використовується в сценаріях, де потрібно визначити день тижня для певної дати, наприклад, при створенні календарів, плануванні подій або в обчисленнях, пов'язаних з робочими днями. Він також корисний для встановлення умов в залежності від дня тижня.



Для порівняння двох об'єктів datetime у Python, ви можете використовувати стандартні оператори порівняння, такі як == (рівність), != (нерівність), < (менше), > (більше), <= (менше або дорівнює) та >= (більше або дорівнює). Ці оператори дозволяють порівнювати дати та часи, щоб визначити, чи один об'єкт datetime передує, наступає або є точно таким самим як інший.



✂️ Цей код можна запустити!

from datetime import datetime

# Створення двох об'єктів datetime
datetime1 = datetime(2023, 3, 14, 12, 0)
datetime2 = datetime(2023, 3, 15, 12, 0)

# Порівняння дат
print(datetime1 == datetime2)  # False, тому що дати не однакові
print(datetime1 != datetime2)  # True, тому що дати різні
print(datetime1 < datetime2)   # True, тому що datetime1 передує datetime2
print(datetime1 > datetime2)   # False, тому що datetime1 не наступає за datetime2



Виведення:

False
True
True
False





Ключові аспекти: методи роботи з датами і часом

datetime.now(): Метод повертає об'єкт datetime, який містить поточну дату та час.
datetime.date(): Цей метод повертає об'єкт date, який представляє лише дату (без часу).
datetime.time(): Метод повертає об'єкт time, який містить лише час (без дати).
datetime.combine(date, time): Цей метод використовується для об'єднання об'єктів date та time і створення нового об'єкта datetime.
datetime(year, month, day, hour=0, minute=0, second=0, microsecond=0): Конструктор класу datetime дозволяє створити об'єкт datetime з конкретною датою та часом.
weekday(): Метод визначає номер дня тижня для вказаної дати, де понеділок має номер 0, а неділя - 6.


Методи порівняння об'єктів datetime:



== (рівність): Порівнює, чи є дві дати рівні.
!= (нерівність): Порівнює, чи дві дати не є рівними.
< (менше): Визначає, чи одна дата передує іншій.
> (більше): Визначає, чи одна дата наступає за іншою.
<= (менше або дорівнює): Порівнює, чи одна дата менше або дорівнює іншій.
>= (більше або дорівнює): Порівнює, чи одна дата більше або дорівнює іншій.



Робота з часовими проміжками timedelta



У модулі datetime є клас timedelta, який використовується для представлення різниці між двома моментами в часі. Об'єкти timedelta можуть представляти дні, години, хвилини, секунди та мікросекунди. Вони корисні для розрахунків, що включають додавання або віднімання часу від конкретних дат або порівняння часових інтервалів.



Об'єкт timedelta можна створити, задаючи тижні, дні, години, хвилини, секунди, мілісекунди і мікросекунди, передавши один або кілька з таких параметрів: days, seconds, microseconds, milliseconds, minutes, hours, weeks. Якщо якийсь параметр не заданий, то він дорівнює 0 за замовчуванням.



✂️ Цей код можна запустити!

from datetime import timedelta
delta = timedelta(
    days=50,
    seconds=27,
    microseconds=10,
    milliseconds=29000,
    minutes=5,
    hours=8,
    weeks=2
)
print(delta)



Виведення:



64 days, 8:05:56.000010



Якщо відняти від одного datetime об'єкту інший, то отримаємо timedelta об'єкт. Він відповідає за відрізок часу між двома датами.



✂️ Цей код можна запустити!

from datetime import datetime

seventh_day_2019 = datetime(year=2019, month=1, day=7, hour=14)
seventh_day_2020 = datetime(year=2020, month=1, day=7, hour=14)

difference = seventh_day_2020 - seventh_day_2019
print(difference)  # 365 days, 0:00:00
print(difference.total_seconds())  # 31536000.0



Тут ми ще за допомоги методу total_seconds виконали конвертацію timedelta в секунди.



Виведення:



365 days, 0:00:00
31536000.0



Максимальний діапазон для timedelta обмежений приблизно 9999 роками, що більше ніж достатньо для більшості застосувань. Об'єкти timedelta можна створювати, щоб отримати дату/час віддалену від початкової.



✂️ Цей код можна запустити!

from datetime import datetime, timedelta

now = datetime.now()
future_date = now + timedelta(days=10)  # Додаємо 10 днів до поточної дати
print(future_date)



Виведення:

2023-12-28 14:08:46.342976



Або від якоїсь конкретної дати.



✂️ Цей код можна запустити!

from datetime import datetime, timedelta

seventh_day_2020 = datetime(year=2020, month=1, day=7, hour=14)
four_weeks_interval = timedelta(weeks=4)

print(seventh_day_2020 + four_weeks_interval)  # 2020-02-04 14:00:00
print(seventh_day_2020 - four_weeks_interval)  # 2019-12-10 14:00:00



Виведення:

2020-02-04 14:00:00
2019-12-10 14:00:00



Але якщо потрібно робити обчислення або порівняння, засновані на послідовності дат, наприклад, для визначення кількості днів між двома датами.



Ми можемо використати метод toordinal(), який повертає порядковий номер дня, враховуючи кількість днів з 1 січня року 1 нашої ери (тобто з початку християнського календаря). Цей метод перетворює об'єкт datetime в ціле число, що представляє порядковий номер даного дня.



✂️ Цей код можна запустити!

from datetime import datetime

# Створення об'єкта datetime
date = datetime(year=2023, month=12, day=18)

# Отримання порядкового номера
ordinal_number = date.toordinal()
print(f"Порядковий номер дати {date} становить {ordinal_number}")



Виведення:

Порядковий номер дати 2023-12-18 00:00:00 становить 738872



Наприклад ми хочемо визначити скільки пройшло повних днів, коли Наполеон спалив Москву, а це відбулося 14 вересня 1812 року



✂️ Цей код можна запустити!

from datetime import datetime

# Встановлення дати спалення Москви Наполеоном (14 вересня 1812 року)
napoleon_burns_moscow = datetime(year=1812, month=9, day=14)

# Поточна дата
current_date = datetime.now()

# Розрахунок кількості днів
days_since = current_date.toordinal() - napoleon_burns_moscow.toordinal()
print(days_since)



Виведення:

77161



Отже пройшов 77,161 день від цієї дати станом на поточну дату (18.12.2023) запуску коду. Якщо ви запустите цей код самостійно число днів звісно збільшиться. Спробуйте 😉

Робота з timestamp



У контексті програмування та обробки даних, термін timestamp (часова мітка) використовується для вказівки конкретного моменту в часі. Це зазвичай представляється як кількість секунд (або мілісекунд/мікросекунд у деяких системах) з певної початкової дати, найчастіше з 1 січня 1970 року в UTC, це часовий пояс Гринвіча. Детально про сам UTC поговоримо трошки далі. Поки timestamp для нас це просто прийнята константа і нічого особливого вона не означає. Просто для зручності люди колись почали відраховувати час в секундах з цієї миті і це виявилося дуже зручно. Є стандартним способом представлення часу в багатьох операційних системах та програмних мовах.



Адже порівняти два числа завжди легше і швидше, ніж порівняти складну структуру дат і часів. Ви зустрінете використання timestamp в програмуванні, базах даних, логуванні подій та при збереженні інформації про часові моменти подій.



☝ timestamp є універсальним способом представлення часу, оскільки він не залежить від часових зон і календарних систем.


У Python ви можете перетворити об'єкт datetime в timestamp і навпаки. Конвертація datetime в timestamp



✂️ Цей код можна запустити!

from datetime import datetime

# Поточний час
now = datetime.now()

# Конвертація datetime в timestamp
timestamp = datetime.timestamp(now)
print(timestamp)  # Виведе timestamp поточного часу



Виведення:

1702854066.56633



Конвертація timestamp в об'єкт datetime



✂️ Цей код можна запустити!

from datetime import datetime

# Припустимо, є timestamp
timestamp = 1617183600

# Конвертація timestamp назад у datetime
dt_object = datetime.fromtimestamp(timestamp)
print(dt_object)  # Виведе відповідний datetime



Виведення:

2021-03-31 12:40:00





Парсинг дати із рядка

Коли потрібно відобразити дату та час у зрозумілому для людини форматі, ми використовуємо метод strftime. Він застосовується при записувані часових міток у файли логування, при відображані дати та часу на веб-сторінках або в інтерфейсах користувача, а також при форматуванні дат для збереження в базах даних.



Отже метод strftime використовується для форматування об'єктів дати та часу datetime у рядки за допомогою специфічних форматних кодів. Цей метод дає можливість представити дату та час у зручному для читання форматі або в форматі, що відповідає специфічним вимогам.



Синтаксис методу strftime виглядає наступним чином:



datetime_object.strftime(format)



Де datetime_object - це об'єкт datetime, а format - рядок формату, який визначає, як дата та час повинні бути представлені.



Кожен код у рядку формату починається з символу % і представляє певний компонент дати або часу. Ось деякі з найбільш використовуваних кодів:



%Y - рік з чотирма цифрами (наприклад, 2023).
%y - рік з двома цифрами (наприклад, 23).
%m - місяць як номер (наприклад, 03 для березня).
%d - день місяця як номер (наприклад, 14).
%H - година (24-годинний формат) (наприклад, 15).
%I - година (12-годинний формат) (наприклад, 03).
%M - хвилини (наприклад, 05).
%S - секунди (наприклад, 09).
%A - повна назва дня тижня (наприклад, Tuesday).
%a - скорочена назва дня тижня (наприклад, Tue).
%B - повна назва місяця (наприклад, March).
%b або %h - скорочена назва місяця (наприклад, Mar).
%p - AM або PM для 12-годинного формату.


Розглянемо декілька прикладів



✂️ Цей код можна запустити!

from datetime import datetime

now = datetime.now()

# Форматування дати і часу
formatted_date = now.strftime("%Y-%m-%d %H:%M:%S")
print(formatted_date) 

# Форматування лише дати
formatted_date_only = now.strftime("%A, %d %B %Y")
print(formatted_date_only)

# Форматування лише часу
formatted_time_only = now.strftime("%I:%M %p")
print(formatted_time_only)  

# Форматування лише дати
formatted_date_only = now.strftime("%d.%m.%Y")
print(formatted_date_only)



Виведення:

2023-12-18 01:37:07
Monday, 18 December 2023
01:37 AM
18.12.2023



Метод strptime в Python використовується для перетворення рядків у об'єкти datetime. Цей метод є протилежністю до strftime, який перетворює об'єкти datetime у рядки. strptime дозволяє аналізувати рядки, що містять дату та/або час, і перетворювати їх на структуровані об'єкти datetime за допомогою визначеного формату.



Синтаксис методу strptime виглядає наступним чином:



datetime_object = datetime.strptime(string, format)



де:

string - рядок, який містить дату та/або час.
format - рядок формату, який вказує, як розібрати string.


Коди форматування для strptime такі ж, як і для strftime. Наприклад, %Y представляє рік із чотирма цифрами, %m - місяць у вигляді двоцифрового числа тощо.



Розглянемо випадок коли з веб-сайту є рядок дата "2023.03.14" якогось посту і нам треба перед тим як зберегти дату в базі даних перетворити її на об'єкт datetime



✂️ Цей код можна запустити!

from datetime import datetime

# Припустимо, у нас є дата у вигляді рядка
date_string = "2023.03.14"

# Перетворення рядка в об'єкт datetime
datetime_object = datetime.strptime(date_string, "%Y.%m.%d")
print(datetime_object)  # Виведе об'єкт datetime, що відповідає вказаній даті та часу



У цьому прикладі рядок date_string перетворюється в об'єкт datetime за допомогою визначеного формату: "2023.03.14" це "%Y.%m.%d".



Виведення:



2023-03-14 00:00:00



З точки зору застосування, метод strptime корисний, коли потрібно обробляти дати та часи, які отримані у форматі рядка, наприклад, з текстових файлів, користувацького вводу, веб-запитів або баз даних. Він дозволяє перетворити ці рядки на об'єкти datetime, якими вже потім легко маніпулювати в коді.

Робота з ISO форматом дати



ISO формат дати відноситься до міжнародного стандарту представлення дат і часу, відомого як ISO 8601. Цей стандарт створений Міжнародною організацією стандартизації (ISO) та використовується для уніфікації представлення дати та часу у всьому світі.



Формат дати в ISO 8601 виглядає як "YYYY-MM-DD", де:



YYYY - це рік (наприклад, 2023),
MM - місяць (наприклад, 01 для січня),
DD - день (наприклад, 31).


Формат часу в ISO 8601 виглядає як "HH:MM:SS", де:



HH - години (від 00 до 23),
MM - хвилини (від 00 до 59),
SS - секунди (від 00 до 59, іноді з додатковими десятковими частинами для мікросекунд).


Повне представлення дати та часу в ISO 8601 поєднує ці два формати з "T" між ними, наприклад "YYYY-MM-DDTHH:MM:SS". Це відділяє дату від часу і формат легко відрізняється від інших представлень.



ISO 8601 також підтримує представлення часових зон. Наприклад, "Z" на кінці означає UTC (координований всесвітній час), а відхилення від UTC може бути представлене як "+HH:MM" або "-HH:MM". Термін UTC, що розшифровується як Всесвітній координований час (англ. Coordinated Universal Time), є основною системою часу, від якої регулюються всі часові зони у світі. Він використовується як світовий стандарт часу. Він не змінюється з порами року та не підлягає переходу на літній/зимовий час, на відміну від багатьох місцевих часових зон.



Через свою універсальність, UTC широко використовується в міжнародних комунікаціях, авіації, астрономії та інших галузях. Локальні часові зони часто визначаються як UTC плюс або мінус певна кількість годин.



Модуль datetime надає зручні інструменти для роботи з датами та часом у форматі ISO 8601. Об'єкт datetime можна легко перетворити в рядок формату ISO 8601 за допомогою методу isoformat():



✂️ Цей код можна запустити!

from datetime import datetime

# Поточна дата та час
now = datetime.now()

# Конвертація у формат ISO 8601
iso_format = now.isoformat()
print(iso_format)



Виведе, наприклад:

2023-12-14T15:43:42.651309



Для зворотного перетворення рядка у форматі ISO 8601 на об'єкт datetime, можна використати метод fromisoformat():



✂️ Цей код можна запустити!

from datetime import datetime

iso_date_string = "2023-03-14T12:39:29.992996"

# Конвертація з ISO формату
date_from_iso = datetime.fromisoformat(iso_date_string)
print(date_from_iso)



Виведе об'єкт datetime, що відповідає вказаній даті та часу



2023-03-14 12:39:29.992996



Метод isoweekday() у об'єкті datetime використовується для отримання дня тижня відповідно до ISO 8601. Згідно з цим стандартом, тиждень починається з понеділка, який має значення 1, і закінчується неділею, яка має значення 7.



✂️ Цей код можна запустити!

from datetime import datetime

# Створення об'єкта datetime
now = datetime.now()

# Використання isoweekday() для отримання дня тижня
day_of_week = now.isoweekday()

print(f"Сьогодні: {day_of_week}")  # Поверне число від 1 до 7, що відповідає дню тижня



У цьому прикладі day_of_week буде містити число від 1 до 7, де 1 відповідає понеділку, а 7 - неділі. Для четверга виведення буде:



Сьогодні: 4



Метод isoweekday() корисний у сценаріях, де потрібно визначити конкретний день тижня, наприклад, при плануванні подій або виконанні дій, залежних від дня тижня. Це може бути особливо корисним у бізнес-логіці, яка оперує робочими та вихідними днями.



Також розглянемо корисний метод isocalendar(), який використовується для отримання кортежу, що містить ISO рік, номер тижня в році та номер дня тижня відповідно до ISO 8601.



Вивід isocalendar() - це кортеж (ISO_рік, ISO_тиждень, ISO_день_тижня), де:



ISO_рік - це рік у форматі ISO.
ISO_тиждень - номер тижня в році за ISO 8601 (від 1 до 53).
ISO_день_тижня - день тижня за ISO 8601, де 1 означає понеділок, а 7 - неділю.


✂️ Цей код можна запустити!

from datetime import datetime

# Створення об'єкта datetime
now = datetime.now()

# Отримання ISO календаря
iso_calendar = now.isocalendar()

print(f"ISO рік: {iso_calendar[0]}, ISO тиждень: {iso_calendar[1]}, ISO день тижня: {iso_calendar[2]}")



У цьому прикладі iso_calendar буде містити три значення: ISO рік, номер тижня та номер дня тижня, у форматі datetime.IsoCalendarDate(year=2023, week=50, weekday=4). Виведення до 14.12.2023 буде:



ISO рік: 2023, ISO тиждень: 50, ISO день тижня: 4



Метод isocalendar() корисний у ситуаціях, коли потрібно працювати з тижневими інтервалами або розраховувати дати у форматі, який широко використовується в бізнес-плануванні та логістиці. Він також може бути корисним для визначення конкретного тижня року для подій або при плануванні завдань.





Ключові аспекти: методи для роботи з ISO форматом дати

Отже, коротко підсумуємо використання методів, які ми щойно розглянули:



Метод isoformat() використовується для конвертації об'єкта datetime в рядок у форматі ISO 8601.
Метод fromisoformat() використовується для конвертації рядка у форматі ISO 8601 в об'єкт datetime.
Метод isoweekday() використовується для отримання дня тижня відповідно до ISO 8601.
Метод isocalendar() використовується для отримання кортежу, що містить ISO рік, номер тижня в році та номер дня тижня відповідно до ISO 8601.

Робота з часовими зонами






Щоб вивести дату у форматі UTC це можна зробити, додавши інформацію про часову зону до об'єкта datetime:



✂️ Цей код можна запустити!

from datetime import datetime, timezone

local_now = datetime.now()
utc_now = datetime.now(timezone.utc)

print(local_now)
print(utc_now)  # Виведе поточний час в UTC



Виведення:

2023-12-14 16:39:33.883454
2023-12-14 14:39:33.883454+00:00



Щоб перетворити час з UTC в іншу часову зону, вам знадобиться визначити об'єкт timezone з відповідним зсувом. Наприклад, для перетворення UTC часу в час, що відповідає Східному часовому поясу США (UTC-5 годин), можна зробити наступне:



✂️ Цей код можна запустити!

from datetime import datetime, timezone, timedelta

utc_time = datetime.now(timezone.utc)

# Створення часової зони для Східного часового поясу (UTC-5)
eastern_time = utc_time.astimezone(timezone(timedelta(hours=-5)))
# Перетворює час UTC в час Східного часового поясу
print(eastern_time)  



Виведення:

2023-12-14 09:43:06.778253-05:00



Щоб перетворити локальний час у час UTC, спочатку потрібно призначити

локальному часу відповідну часову зону, а потім використати метод astimezone() для конвертації його в UTC:



✂️ Цей код можна запустити!

from datetime import datetime, timezone, timedelta

# Припустимо, місцевий час належить до часової зони UTC+2
local_timezone = timezone(timedelta(hours=2))
local_time = datetime(year=2023, month=3, day=14, hour=12, minute=30, second=0, tzinfo=local_timezone)

# Конвертація локального часу в UTC
utc_time = local_time.astimezone(timezone.utc)
print(utc_time)  # Виведе час в UTC



У цьому прикладі, ми створили об'єкт datetime з часовою зоною UTC+2 (Київ) та перетворили його в час UTC. Виведення:



2023-03-14 10:30:00+00:00



Стандарт ISO 8601 також підтримує часові зони. У Python це можна зробити, додавши інформацію про часову зону до об'єкта datetime:



✂️ Цей код можна запустити!

from datetime import datetime, timezone, timedelta

# Час у конкретній часовій зоні
timezone_offset = timezone(timedelta(hours=2))  # Наприклад, UTC+2
timezone_datetime = datetime(year=2023, month=3, day=14, hour=12, minute=30, second=0, tzinfo=timezone_offset)

# Конвертація у формат ISO 8601
iso_format_with_timezone = timezone_datetime.isoformat()
print(iso_format_with_timezone)



Виведення:

2023-03-14T12:30:00+02:00



Ці методи в datetime модулі роблять роботу з ISO форматом простою та ефективною, дозволяючи легко інтегрувати стандартизоване представлення дат та часу в Python-програми.





Ключові аспекти: методи для роботи з часовими зонами у Python

Отже, ми розглянули такі методи та принципи роботи з ними:



Додавання інформації про часову зону до об'єкта datetime:

Метод astimezone використовується для перетворення об'єкта datetime з однієї часової зони в іншу. Наприклад, це може бути використано для конвертації часу з UTC в інші часові зони.


Перетворення локального часу в час UTC:

Спочатку призначаємо локальному часу відповідну часову зону.
Використовуємо astimezone для конвертації в UTC. Цей підхід допомагає зручно працювати з локальним та всесвітнім часом.


Форматування у форматі ISO 8601 із часовою зоною:

Використовуємо isoformat для отримання рядка з об'єкта datetime у форматі ISO 8601 з часовою зоною. Це корисно для представлення дати та часу у єдиному стандартізованому вигляді.



Робота з часом



Модуль time у Python надає функції для роботи з часом, зокрема з часовими мітками timestamps, паузами виконання для програми, а також іншими часовими операціями.



Модуль використовується для різноманітних задач, пов'язаних з часом, включаючи логування, таймінг операцій, створення пауз виконання програми, обробку часових міток та форматування часу для відображення користувачам. Є базовим інструментом для роботи з часом у Python, хоча він і не включає підтримку часових зон або складних операцій з датами, які забезпечуються розглянутим раніше модулем datetime.



Розглянемо основні методи модуля time



Метод time.time() повертає поточний час у секундах з 1 січня 1970 року (epoch time).



✂️ Цей код можна запустити!

import time

current_time = time.time()
print(f"Поточний час: {current_time}")



Виведення:

Поточний час: 1702857932.326853



Метод time.sleep(seconds) зупиняє виконання програми на вказану кількість секунд. Наприклад цей код зупиняє виконання програми на 5 секунд.



✂️ Цей код можна запустити!

import time

print("Початок паузи")
time.sleep(5)
print("Кінець паузи")



Метод time.ctime([seconds]) перетворює часову мітку (кількість секунд) у зрозуміле для людини текстове представлення. Якщо аргумент не вказаний, використовується поточний час.



✂️ Цей код можна запустити!

import time

current_time = time.time()
print(f"Поточний час: {current_time}")

readable_time = time.ctime(current_time)
print(f"Читабельний час: {readable_time}")



Виведення:

Поточний час: 170285823.9412928
Читабельний час: Mon Dec 18 02:08:43 2023



Метод time.localtime([seconds]) перетворює часову мітку в структуру struct_time у місцевій часовій зоні.



✂️ Цей код можна запустити!

import time

current_time = time.time()
print(f"Поточний час: {current_time}")

local_time = time.localtime(current_time)
print(f"Місцевий час: {local_time}")



Виведення:

Поточний час: 1702861070.8583968
Місцевий час: time.struct_time(tm_year=2023, tm_mon=12, tm_mday=18, tm_hour=2, tm_min=57, tm_sec=50, tm_wday=0, tm_yday=352, tm_isdst=0)



Об'єкт time.struct_time в Python є іменованим кортежем, який використовується для представлення часу. Кожен елемент кортежу має особливе значення, що представляє певний компонент дати та часу:



tm_year - рік
tm_mon - місяць від 1 до 12
tm_mday - день місяця від 1 до 31
tm_hour - години від 0 до 23
tm_min - хвилини від 0 до 59
tm_sec - секунди від 0 до 59
tm_wday - день тижня від 0 до 6
tm_yday - день року від 1 до 366
tm_isdst - прапорець літнього часу. 0 означає, що літній час не діє, -1 - інформація відсутня, 1 - літній час діє


Метод time.gmtime([seconds]) схожий на localtime, але повертає struct_time у UTC.



Досить важливим є метод time.perf_counter(), який надає доступ до лічильника з високою точністю, та є ідеальним для вимірювання коротких інтервалів часу.



Цей лічильник має найвищу доступну точність для вимірювання коротких часових періодів і використовується в основному для визначення часу виконання коду.



Як це працює? Метод time.perf_counter() повертає значення в секундах (як дійсне число) з деякого моменту, наприклад з моменту запуску програми, і це значення монотонно збільшується. Це означає, що воно може використовуватися для точного вимірювання відрізків часу.



Давайте використаємо time.perf_counter() для вимірювання часу виконання деякого блоку коду:



✂️ Цей код можна запустити!

import time

# Записуємо час на початку виконання
start_time = time.perf_counter()

# Виконуємо якусь операцію
for _ in range(1_000_000):
    pass  # Просто проходить цикл мільйон разів

# Записуємо час після виконання операції
end_time = time.perf_counter()

# Розраховуємо та виводимо час виконання
execution_time = end_time - start_time
print(f"Час виконання: {execution_time} секунд")



У цьому прикладі ми вимірюємо час, необхідний для проходження циклу мільйон разів. Змінні start_time і end_time вимірюють час на початку та в кінці циклу, відповідно, а різниця між ними дає нам загальний час виконання операцій циклу.



Виведення:

Час виконання: 0.04927480001060758 секунд



Метод дуже корисний для точного вимірювання часу виконання коду, особливо у випадках, коли потрібно визначити продуктивність або оптимізувати певні аспекти програми.



В цьому прикладі ми зустріли декілька нових речей. Перше, це що в Python представлення чисел з підкресленнями _ є способом зробити великі числа більш читабельними. Наприклад, число 1_000_000 еквівалентне 1000000.



✂️ Цей код можна запустити!

# Один мільйон
a = 1_000_000
print(a)  # Виведе 1000000

# Десять мільйонів
b = 10_000_000
print(b)  # Виведе 10000000

# Один мільярд
c = 1_000_000_000
print(c)  # Виведе 1000000000



Підкреслення в цьому контексті є просто візуальними розділювачами, які допомагають легше сприймати великі числа, але не впливають на їхню числову величину чи поведінку.



Друге, це оператор pass, який використовується як заповнювач або "пуста" інструкція. Він не робить нічого і використовується там, де синтаксис вимагає наявності хоча б однієї інструкції, але вам не потрібно виконувати жодних дій.



Іншими словами, pass можна використовувати для позначення місця в коді, яке може бути заповнене пізніше. В нашому прикладі, pass використовується всередині циклу for. Це означає, що на кожній ітерації циклу виконується pass, який не робить нічого. Цикл просто проходить мільйон ітерацій, не виконуючи жодної дії на кожній з них.



Є і інші випадки використання pass наприклад у функціях:



def my_function():
    pass



Тут pass використовується у функції, яка поки що не має вмісту.

Оператор pass є корисним для тимчасового "заповнення" місця в коді, що дозволяє вашій програмі виконуватися, навіть коли певні частини ще не були реалізовані.





Ключові аспекти: основні методи модуля time в Python

time.time(): Повертає поточний час у секундах з 1 січня 1970 року (epoch time).
time.sleep(seconds): Зупиняє виконання програми на вказану кількість секунд.
time.ctime([seconds]): Перетворює часову мітку в текстове представлення, зрозуміле для людини.
time.localtime([seconds]): Перетворює часову мітку в структуру struct_time у місцевій часовій зоні.
time.gmtime([seconds]): Аналогічно localtime, але повертає struct_time у форматі UTC.
time.perf_counter(): Повертає лічильник з високою точністю для вимірювання коротких інтервалів часу.

Робота з випадковими величинами



Робота з випадковими величинами є важливою частиною багатьох областей, включаючи статистику, інженерію, науку про дані та фінанси. Випадкова величина — це змінна, значення якої є результатом випадкових явищ або експериментів. Існують два основних типи випадкових величин: дискретні та неперервні.



Дискретні випадкові величини: Це такі, які приймають обмежену кількість значень або значення, які можна перелічити. Наприклад, кількість монет, що випали решкою у серії підкидань, є дискретною випадковою величиною.
Неперервні випадкові величини: Вони можуть приймати будь-яке значення у певному діапазоні. Наприклад, змінна, яка представляє час, необхідний для виконання певної задачі, є неперервною випадковою величиною.


Робота з випадковими величинами в програмуванні є ключовим елементом багатьох програмних застосунків, від ігор до наукових симуляцій. Для генерації випадкових (псевдовипадкових) чисел у Python є пакет random. Він досить хороший для ряду звичайних завдань, але не для криптографії. Бо на жаль, вбудований генератор псевдовипадкових чисел досить скоро починає повторюватися і не є достатньо криптостійким. Проте, для прикладних завдань поза сферою криптографії його цілком вистачає. Розглянемо основні методи пакету які можуть нам знадобиться в роботі.



Для отримання випадкового цілого числа з рівномірного розподілу в інтервалі між a та b включно треба використати метод random.randint(a, b). Він повертає випадкове ціле число N таке, що a <= N <= b:



import random

random.randint(1, 1000)



Це метод, наприклад, підходить для симуляції кидка кубика:



✂️ Цей код можна запустити!

import random

dice_roll = random.randint(1, 6)
print(f"Ви кинули {dice_roll}")



Виведення:

Ви кинули 2



Метод random.random() потрібен, щоб отримати випадкове число в інтервалі 0, 1. Він генерує випадкове дійсне число між 0.0 (включно) та 1.0 (не включно):



✂️ Цей код можна запустити!

import random

num = random.random()
print(num)



Виведення:

0.7189476089786198



Оскільки це випадкове число вивід кожен раз буде іншим.

Припустимо, вам потрібно симулювати випадкове відсоткове заповнення. Можна використовувати random.random() для цього:



✂️ Цей код можна запустити!

import random

fill_percentage = random.random() * 100
print(f"Заповнення: {fill_percentage:.2f}%")



Виведення:

Заповнення: 64.01%



Тут в f рядку з'явилось форматування {fill_percentage:.2f} яке вказує, яким чином відображати змінну fill_percentage. Вираз .2 це кількість знаків після десяткової крапки. У цьому випадку вказано, що потрібно відображати два знаки для дійсного числа. Символ f означає, що число має бути відображене у форматі дійсного числа.



☝ Відсоток - це спосіб вираження числа як частини зі ста. Один відсоток, записаний як 1%, є еквівалентом 1/100 або однієї сотої частини. Тож, коли ми говоримо, що щось становить 50%, це означає 50 зі 100 або половину цілого.
Щоб перетворити відсоток у дріб, ділимо число на 100. Наприклад, 20% стане 20/100 або 0.20. Для перетворення дробу в відсоток, множимо його на 100. Так, 0.20 стане 20%.


Метод random.randrange(start, stop[, step]) повертає випадково вибране число з заданого діапазону.



Параметри методу:



start - нижня межа діапазону (включно). Це початкове значення, з якого може починатися випадковий вибір. Якщо не вказано, за замовчуванням приймається нуль, і діапазон починається з 0.
stop - верхня межа діапазону (не включно). Це означає, що вибране випадкове число буде меншим, ніж це значення. Цей параметр є обов'язковим, і метод не буде працювати без нього.
step - крок між можливими значеннями. Наприклад, якщо встановити step як 2, метод буде вибирати лише парні числа або числа, кратні 2, в залежності від start. Цей параметр є необов'язковим і за замовчуванням дорівнює 1, що означає, що вибір відбувається з усіх послідовних чисел у діапазоні.


Тому щоб вибрати випадкове число від 0 до 9:



import random
print(random.randrange(10))  # Верхня межа є 10, але не включається



Наприклад симуляція пострілу по мішені, але необхідно вибрати випадковий номер від 1 до 10, та лише непарні числа:



✂️ Цей код можна запустити!

import random

target = random.randrange(1, 11, 2)
print(f"Ціль: {target}")



Виведення:

Ціль: 3



Коли у вас є список об'єктів і вам потрібно перемішати порядок елементів в цьому списку на випадковий, ми використовуємо метод random.shuffle(x), де x - список, який потрібно перемішати.



Перемішування колоди карт:



✂️ Цей код можна запустити!

import random

cards = ["Туз", "Король", "Дама", "Валет", "10", "9", "8", "7", "6"]

random.shuffle(cards)

print(f"Перемішана колода: {cards}")



Виведення:

Перемішана колода: ['Дама', 'Валет', 'Туз', '9', '6', 'Король', '10', '7', '8']



Якщо потрібно вибрати випадковий елемент зі списку, нам потрібно використати метод random.choice(seq), де seq - послідовність для вибору: список або кортеж.



Вибір випадкового фрукта:



✂️ Цей код можна запустити!

import random

fruits = ['apple', 'banana', 'orange']
print(random.choice(fruits))



Виведення:

banana



Щоб вибрати більше чим один випадковий елемент зі списку, нам необхідний метод random.choices(). Він використовується для генерації випадкової вибірки із послідовності. Цей метод може повернути один або декілька елементів з вказаної послідовності, при цьому дозволяючи повторення елементів у вибірці.



Синтаксис методу random.choices() наступний:

random.choices(population, weights=None, cum_weights=None, k=1)



population - послідовність список, з якої має бути зроблений вибір.
weights - опціональний список, який вказує ймовірності (ваги) кожного елемента в списку population. Ці ваги визначають, наскільки ймовірно, що конкретний елемент буде обраний. Довжина списку weights має бути дорівнювати довжині списку population.
cum_weights - теж опціональний список кумулятивних ваг. Якщо він вказаний, то список weights ігнорується. Кумулятивна вага кожного елемента визначається як сума його ваги плюс ваги всіх попередніх елементів.
k: Кількість елементів для вибору. За замовчуванням k=1.


Простий вибір випадкового елемента зі списку:



✂️ Цей код можна запустити!

import random

items = ['яблуко', 'банан', 'вишня', 'диня']
chosen_item = random.choices(items, k=1)
print(chosen_item)  



Вибирає один фрукт зі списку:

['диня']



Вибір декількох елементів з можливістю повторень:



✂️ Цей код можна запустити!

import random

numbers = [1, 2, 3, 4, 5]
chosen_numbers = random.choices(numbers, k=3)
print(chosen_numbers)



Може вибрати будь-які три числа, наприклад:

[3, 3, 5]



Вибір з вагами:



✂️ Цей код можна запустити!

import random

colors = ['червоний', 'зелений', 'синій']
weights = [10, 1, 1]
chosen_color = random.choices(colors, weights, k=1)
print(chosen_color)  



Елемент 'червоний' має набагато більшу ймовірність бути обраним:



['червоний']



random.choices() - це гнучкий метод для створення випадкових вибірок з можливістю зазначення ймовірностей для кожного елемента та можливістю повторень у вибірці.



Якщо виникає необхідність вибрати N елементів зі списку і вони при цьому не повторювалися треба використати метод random.sample(population, k). Він повертає список довжиною k з унікальними елементами, вибраними випадково з population.



Створення випадкової команди з 4 учасників з групи з 10 осіб:



✂️ Цей код можна запустити!

import random

participants = ['Анна', 'Богдан', 'Віктор', 'Галина', 'Дмитро', 'Олена', 'Женя', 'Зорян', 'Ігор', 'Йосип']
team = random.sample(participants, 4)
print(f"Команда: {team}")



Виведення:

Команда: ['Анна', 'Віктор', 'Олена', 'Галина']



Зверніть увагу, що k не може бути більше довжини participants.



Останній корисний метод, який розглянемо це random.uniform(a, b). Метод повертає випадкове дійсне число N, таке що a <= N <= b.



Приклад генерації випадкової ціни для продукту в межах від 50 до 100:



✂️ Цей код можна запустити!

import random

price = random.uniform(50, 100)
print(f"Випадкова ціна: {price:.2f}")



Виведення:

Випадкова ціна: 69.64







Ключові аспекти: методи для роботи з випадковими величинами

random.randint(a, b): Отримання випадкового цілого числа з рівномірного розподілу в інтервалі між a та b включно.
random.random(): Отримання випадкового числа в інтервалі між 0.0 (включно) та 1.0 (не включно).
random.randrange(start, stop[, step]): Отримання випадкового числа з заданого діапазону, з можливістю вказати крок між значеннями.
random.shuffle(x): Перемішування порядку елементів у списку x.
random.choice(seq): Вибір випадкового елемента з послідовності seq (списку або кортежу).
random.choices(population, weights=None, cum_weights=None, k=1): Генерація випадкової вибірки з можливістю зазначити ймовірності для кожного елемента та повторення у вибірці.
random.sample(population, k): Отримання унікальних випадкових елементів зі списку population довжиною k.
random.uniform(a, b): Отримання випадкового дійсного числа N такого, що a <= N <= b.

Модуль math



Пакет math у Python надає доступ до математичних функцій, визначених стандартом мови C. Цей пакет включає функції для різних математичних операцій, включаючи тригонометричні обчислення, логарифми, квадратний корінь та інше.



Розглянемо деякі з ключових функцій і констант, які надає цей пакет:



Константи:

math.pi - константа 
π
π (приблизно 3.14159...);
math.e - константа 
e
e, основа натуральних логарифмів (приблизно 2.71828...);
math.tau - константа 
τ
τ, дорівнює 
2
π
2π (приблизно 6.28318...);
math.inf - позначення нескінченності;
math.nan - позначення 'Not a Number' (не число);


Функції округлення чисел:

math.ceil(x) - виконує округлення дійсного числа x до найближчого більшого цілого числа;
math.floor(x) - виконує округлення дійсного числа x до найближчого меншого цілого числа;
math.trunc(x) - виконує обрізання дробової частини дійсного числа x, та повертає цілу частину числа;


Приклад використання:



✂️ Цей код можна запустити!

import math

# Вихідне число
x = 3.7

# Використання різних методів округлення
ceil_result = math.ceil(x)  # Округлення вгору
floor_result = math.floor(x)  # Округлення вниз
trunc_result = math.trunc(x)  # Відсікання дробової частини

print(ceil_result, floor_result, trunc_result)



Виведення:

4 3 3



Тригонометричні функції



math.sin(x) - синус x, де x в радіанах;
math.cos(x) - косинус x;
math.tan(x) - тангенс x;
math.asin(x) - арксинус x;
math.acos(x) - арккосинус x;
math.atan(x) - арктангенс x;


Експоненційні та логарифмічні функції



math.exp(x) - число 
e
e в ступені x;
math.log(x[, base]) - Логарифм x за основою base. Якщо base не вказано, обчислюється натуральний логарифм;


Ступінь та корінь



math.pow(x, y) - x у ступені y;
math.sqrt(x) - квадратний корінь з x;


Деякі інші функції



math.fabs(x) - модуль (абсолютне значення) x;
math.factorial(x) - факторіал числа x;
math.gcd(x, y) - найбільший спільний дільник для x та y;


Приклад використання пакета math



✂️ Цей код можна запустити!

import math

# Використання констант
print(math.pi)  # Виведе приблизне значення π

# Тригонометрія
angle = math.radians(60)  # Конвертація з градусів у радіани
print(math.sin(angle))  # Синус кута

# Корінь числа
print(math.sqrt(9))  # Квадратний корінь з 9

# Логарифми
print(math.log(10, 2))  # Логарифм 10 за основою 2



Виведення:

3.141592653589793
0.8660254037844386
3.0
3.3219280948873626



Якщо вам потрібна комплексна математика, то можна скористатися пакетом cmath. Він надає той самий API, але вміє працювати з комплексними числами.





Правильне порівняння дійсних чисел

Дійсні числа в комп'ютерних програмах часто можуть викликати неточності через їхню бінарну природу. Це може призвести до несподіваної поведінки при порівнянні чисел. Розглянемо кілька прикладів та способи їх порівняння в Python.



Виконаємо наступне пряме порівняння



✂️ Цей код можна запустити!

print(0.1 + 0.2 == 0.3)  # Це повертає False



Цей код повертає False через неточності в представленні дійсних чисел в сучасних комп'ютерах. Числа 0.1 і 0.2 не можуть бути представлені точно як двійкові дроби в середині комп'ютера, тому їх сума не буде точно дорівнювати 0.3.



print(0.1 + 0.2)



Виведення буде:

0.30000000000000004



Функція math.isclose використовується для порівняння двох чисел з певною допустимою похибкою. Це корисно для порівняння дійсних чисел, де пряме порівняння може бути ненадійним.



✂️ Цей код можна запустити!

import math

r = math.isclose(0.1 + 0.2, 0.3)
print(r)  # Це поверне True



Також ми можемо виконувати порівняння з маленькою похибкою:



✂️ Цей код можна запустити!

import math

r = math.isclose(0.1, 0.10000000009)
print(r)  # Це поверне True



У цьому прикладі math.isclose знову використовується для порівняння двох чисел, де друге число відрізняється від першого на дуже малу величину.



Ці приклади демонструють, як ефективно порівнювати дійсні числа в Python, уникаючи поширених пасток, пов'язаних із точністю представлення цих чисел.
'''



########### Лекція 3. чт 04.03.2025. Тема 3. Модулі datetime та time. Робота з випадковими величинами (лектор Сергій Коденко) 

### модуль datetime


# import datetime as dt
from datetime import datetime as dtdt, timedelta as td
# from datetime import datetime as dtdt, timedelta as td

# print(dir(dt))
# print(dt.MINYEAR, dt.MAXYEAR, dt.UTC)

# print(dtdt.now())
# print(dtdt.now().year)
# print(dtdt.now().month)
# print(dtdt(year=1995, month=4, day=7, hour = 12, minute = 30, second = 13))

dt1 = dtdt(1995, 4, 7, 12, 30, 13) # або або
dt1 = dtdt(year=1995, month=4, day=7, hour = 12, minute = 30, second = 13) # або або
dt2 = dtdt(year=2005, month=4, day=7, hour = 12, minute = 30, second = 13) 
# print(dt2 - dt1)
# print(type(dt2 - dt1))  # <class 'datetime.timedelta'> в днях за замовчуваннях


from datetime import datetime as dtdt, timedelta as td

# td1 = td(days=3650, minutes=50)
# print(td1)
# print(dt2+td1)


# now = dtdt.now()
# # print(now)
# # ts1 = dtdt.timestamp(now)   # кількість секунд з 01.01.1970
# # print(ts1)

# # ts1 = dtdt.timestamp(now) 


# # print(dtdt.fromtimestamp(1))

# # print(dtdt.fromtimestamp(ts1))


# # ISO 8601

# # print(now)
# # print(dtdt.strftime(now, '%Y/%m/%d %H_%M_%S'))
# # print(dtdt.strftime(now, '%Y/%m/%d, yesss, %H_%M_%S'))
# # print(dtdt.strftime(now, '%y %b %d, %a,%I_%M_%S %p'))

# # udow = {
# #     0: 'понеділок',
# #     1: 'вівторок',
# #     2: 'середа',
# #     3: 'четвер',
# #     4: 'пятниця',
# #     5: 'субота',
# #     6: 'неділя'
# # }

# # # print(dtdt.strftime(now, f'%Y/%m/%d , {udow[now.weekday()]}'))   
# # #
# # dt3=dtdt.strptime("01/03/1998, 12:30:45", "%d/%m/%Y, %H:%M:%S")
# # print(dt3)

# # # ISO формат

# # # print(now.isoformat())
# # # print(dtdt.fromisoformat("2024-12-19T08:30:00.000000"))

# # print(dt1)
# # print(dt2)

# # print(dt1<dt2)

# # print(dir(td)) # дивимося структуру об'єкту timedelta


# from datetime import datetime as dtdt, timedelta as td, timezone as tz

# tz1 = tz(td(hours=2), 'UTC+2')
# dt1 = dtdt(year=1995, month=4, day=7, hour = 12, minute = 30, second = 13, tzinfo=tz1)
# print(dt1)

# print(dtdt.today())
# print(dtdt.now(tz1))


# ##  модуль time

# import time

# now = time.time()
# print(now)
# rnow = time.ctime(now)
# print(rnow)

# t1=time.struct_time([2023,12,1,12,35,45,1,125,-1]) # дуже рідко використовується в базах даних
# print(t1)




# import time
# print(time.time())
# time.sleep(3)      # пауза в секундах на запуск виконання наступного коду
# print(time.time())


# start = time.perf_counter()
# time.sleep(3)            
# end = time.perf_counter()
# print(end - start)



### модуль random

import random

# dice = random.randint(1,6) # враховує останнє значення
# print(f"dice: {dice}")

# рандомізатор

# f1 = random.random() # завджи типу float від 0 влючно до 1 невключно [0,1)
# print(f1) 
# print(round(9*f1+1,2)) # [1, 10) від 1 включно до 10 невключно
# print(round(9*f1+1,2))

# print(random.randrange(11))  # [0, 10)
# print(random.randint(0,10))  # [0, 10)


# cards = [2,3,4,5,6,7,8,9,'j', 'q', 'k', 'a']
# print(cards)
# random.shuffle(cards)  # перемішати карти в колоді
# random.shuffle(cards)
# random.shuffle(cards)
# print(cards)

# for i in range(10):
#     random.shuffle(cards)
# print(cards)


fruits = ['apple', 'banana', 'orange', 'mango']
# print(random.choice(fruits))

# for _ in range(10):
#     print(random.choice(fruits))

# for _ in range(10):
#     i = random.randint(0,3)
#     print(fruits[i])


# for _ in range(10):
#     print(random.choices(fruits, k=3))    # допускають повтори фруктів у вибірці

       
# for _ in range(10):
#     print(random.choices(fruits, [2,1,1,1], k=3)) # "вага" кожного фрукту [2,1,1,1]

import random

# fruits = ['apple', 'banana', 'orange', 'mango']
# с_fruits = {'apple':0, 'banana':0, 'orange':0, 'mango':0}
# for _ in range(10):
#     chosen = random.choices(fruits, [2,1,1,1], k=3)   # дає повтори при виборі
#     for f in chosen:
#         с_fruits[f]+=1

# print(с_fruits)


#### random.sample()

# fruits = ['apple', 'apple', 'apple', 'banana', 'orange', 'mango']

# choice = random.sample(fruits, k=2)      # дає унікальні значення у вибірці
# print(choice)


# price = random.uniform(50, 100)   # повертає число в діапазоні
# print(f'price: {price:.2f}')   # :.2f - представлення числа float у форматі 2 цифри після коми



### random.seed() - зерно випадковості

# print(random.seed())


# state = random.getstate()   # отримує стан після виклику наступного коду - збереження даних на момент часу
# print(random.randint(1,5))
# random.setstate(state)      # повертає стан після виклику наступного коду, з урахуванням запам'ятованого поперденього коду
# print(random.randint(1,5))




##### модуль Math

import math

#from math import *    # краще так не робити імпортуємо всі бібліотеки функцій з модуля math

# print(math.pi, math.e, math.inf, math.nan)

# print(math.sin(math.pi))
# print(math.cos(math.pi))


# # 3e5 == 3*10**5  - 3 помножене на 10 в 5 ступені
# print(3e5)

# print(f'{math.sin(math.pi) == 0}')

# print(f'{math.trunc(math.sin(math.pi)):.2f}')

# print(math.isclose(0.1+0.2, 0.3))



# #math.gcd()   # greatest common devisor найбільший спільний дільник 
#                     # співбесіда ловлять на найбільший спільний дільник, на числах Фібаначі, алгоритм Евкліда
# print(math.gcd(15,12))



from decimal import Decimal # модуль для точного підрахунку чисел
# print(Decimal('0.1')+Decimal('0.2')) # вводимо число у форматі str '0.1'



n = 3.25              # на співбесідах люблять питати в чому різниця між функціями 'floor' і 'trunc'
print(math.ceil(n))   # округлення числа до більшого (округлення вверх)
print(math.floor(n))  # округлення числа до меншого (округлення вниз)
print(math.trunc(n))  # відкидає дробову частину від числа
print(round(n))       # нормальне округлення по правилах





#### Логарифми   -- для Data Science, Data Analysis

# a ^ x 
# 3 ^ x = 9
# x = log3(9)    # логарифм показує до якого ступеня треба піднести 3 щоб отримати 9

a = math.log(9)  # теж саме що loge(9) , e =2,71 - натуральний логарифм
print(a)


a = math.log(9, 3)   # x = log3(9)    # логарифм показує до якого ступеня треба піднести 3 щоб отримати 9
print(a)

print(math.e)


#  exp(x) == e^x     exp(3) == e^3
print(math.exp(4*math.log(2)))

print(math.sqrt(4))  # корінь квадратний з числа (степінь 0.5)
print(4**0.5)  # корінь квадратний з числа


print(math.pow(2,4))   # піднесення до степеня 2^4 =16 -> 2**4=16



q = 'string'
print(type(q))
print(dir(q)) # які методи (функції) можемо викликати для цього типу даних

print(help(q))





